function alert(...args) {
  console.log(...args);
}

// function pow(x,n)
// {  открывающаяся фиг.скобка должна быть на предыдущей строке
//   let result=1; не хватает пробелов при присвоении значения переменной
//   for(let i=0;i<n;i++) {result*=x;} не хватает пробелов, тело цикла должно переноситься на следующие строки
//   return result;
// }

// let x=prompt("x?",''), n=prompt("n?",'')  для читаемости лучше инициализировать каждую переменную с новой строки, с учетом пробелов
// if (n<=0)
// { открывающаяся фиг.скобка должна быть на предыдущей строке
//   alert(`Степень ${n} не поддерживается, введите целую степень, большую 0`);
// }
// else
// { открывающаяся фиг.скобка должна быть на предыдущей строке
//   alert(pow(x,n))
// }
